# 21) Определить, позицию второго вхождения строки в списке либо сообщить, что её нет.
# Примеры
# список: ["qwe", "asd", "zxc", "qwe", "ertqwe"], ищем: "qwe", ответ: 3
# список: ["йцу", "фыв", "ячс", "цук", "йцукен", "йцу"], ищем: "йцу", ответ: 5
# список: ["йцу", "фыв", "ячс", "цук", "йцукен"], ищем: "йцу", ответ: -1
# список: ["123", "234", 123, "567"], ищем: "123", ответ: -1
# список: [], ищем: "123", ответ: -1

def search(args, val):
    count = 0
    for i in range(len(args)):
        if val == args[i]:
            count += 1
        if count == 2:
            return i
    return False


list_new = ['abw', '213', 'bbe', '213', 'ler3at']
val = '213'

print(search(list_new, val))
